'''
# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
# импорты
# cv2 - OpenCV - это ведущая свободная библиотека алгоритмов компьютерного зрения, обработки изображений и машинного обучения с открытым кодом. 
#	mediapipe - это библиотека от Google для анализа поз, распознавания лиц, жестов и других задач.
# time - библиотека для работы со временем.
# import powerpoint_logic as pow_log - модуль в проекте. Его полный код следующий: (тут просто написана логика проверки открыта ли презентация)
# (и написанна логика самого переключения). def prev_slide() - функция заглушка потом можно будет написать если не впадлу.
# --------------------------------------------------------------------------------
# import time 
#	import pyautogui as pyu
#	import pygetwindow as gw
#
#	def check_powerpoint() -> bool:
#		try:
#			powerpoint_window = gw.getWindowsWithTitle('PowerPoint')
#			slide_show_window = gw.getWindowsWithTitle('Слайд-шоу')
#			presentation = gw.getWindowsWithTitle('Презентация')
#			if len(powerpoint_window) or len(slide_show_window) or len(presentation):
#				return True
#			return False
#		except:
#			return False
#
#	def next_slide():
#		time.sleep(1)
#		pyu.press('right')
#		print('slide switched!')
#
#	def prev_slide():
#  press
# --------------------------------------------------------------------------------
# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
'''
import sys
import os
import cv2 as cv
import mediapipe as mp
import time
import powerpoint_logic as pow_log


'''
# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
# инициализация камеры
# video = cv.VideoCapture(0) - открываю камеру в отдельном окне. 
#	video.set(cv.CAP_PROP_FRAME_WIDTH/cv.CAP_PROP_FRAME_HEIGHT, _) - ставлю разрешение.
# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
'''
video = cv.VideoCapture(0)
video.set(cv.CAP_PROP_FRAME_WIDTH, 640)
video.set(cv.CAP_PROP_FRAME_HEIGHT, 480)

'''
# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
# Распознавание руки MediaPipe.
# 1) mp_hands = mp.solutions.hands - модуль MediaPipe для распознавания рук. Внутри него: модель нейросети, 
# логика трекинга, описание 21 точки руки 
#	2) mp_hands.Hands() - создание объекта детектора рук. т.е создается модель которая анализирует кадры. Внутри:
# нейросеть (обученная Google),трекинг между кадрами,фильтрация шумов. Можно в конструктор объекта передавать следующие параметры:
#	hands = mp_hands.Hands(
#    	static_image_mode=False,
#    	max_num_hands=2,
#    	min_detection_confidence=0.5,
#    	min_tracking_confidence=0.5
#	)
# static_image_mode - режим видео (False - быстрый, но менее детальный) (True - медленный, но детальный)
# max_num_hands - кол-во рук которые отслеживает модель.
# min_detection_confidence - насколько уверенно модель детектирует руку. (0.8 -> точнее, но может не находить) (0.3 -> находит чаще, но больше ошибок)
# min_tracking_confidence - уверенность при отслеживании между кадрами.
# 3) mp.solutions.drawing_utils - утилита для рисования. в конструктор принимает следующие параметры: 
#	mp_drawing.draw_landmarks(
#    	image,
#    	hand_lms,
#    	mp_hands.HAND_CONNECTIONS
#	)
# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
'''
mp_hands = mp.solutions.hands
hands = mp_hands.Hands()
mp_drawing = mp.solutions.drawing_utils

'''
# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
# Переменные:
# prev_x -> где палец был раньше
# prev_time -> когда это было
# last_swipe_time -> защита от спама
# SWIPE_THRESHOLD -> насколько далеко нужно провести пальцем
# TIME_THRESHOLD -> насколько быстро
# COOLDOWN -> задержка между свайпами
# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
'''

prev_x = None
prev_time = 0
last_swipe_time = 0

SWIPE_THRESHOLD = 80
TIME_THRESHOLD = 0.5
COOLDOWN = 1  

# бесконечный цикл в котором мы постоянно читаем камеру.
while True:
	# читаем кадр в переменную good передается ошибка (в случае ее существования), в image - сам кадр.
	good,image  = video.read()
	if not good:
		break
	
	'''
	# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
	# Подготовка изображения
	# image_rgb = cv.cvtColor(image, cv.COLOR_BGR2RGB) - забираем именно кадр в RGB. т.к mediapipe работает с RGB
	# results = hands.process(image_rgb) - передаю в mediapipe кадр для обработки.
	# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
	'''
	
	hand_detect = False	
	image_rgb = cv.cvtColor(image,cv.COLOR_BGR2RGB)
	results = hands.process(image_rgb)

	# проверка на существования руки в кадре.
	if(results.multi_hand_landmarks):
		# Обработка самой руки (если рук несколько обрабатываются каждая)
		for hand_lms in results.multi_hand_landmarks:
			hand_detected = True
			# рисуем с помощью утилиты скелет руки (число визуал).
			mp_drawing.draw_landmarks(image, hand_lms, mp_hands.HAND_CONNECTIONS)

			# получаем координаты кадра h - высота. w - ширина.
			h, w, _ = image.shape
			for id, point in enumerate(hand_lms.landmark):
				# переводим из простых чисел -> в пиксели.
				cx, cy = int(point.x * w), int(point.y * h)
				'''
				# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
				#	0  — запястье  
				#	1-4  — большой палец  
				#	5-8  — указательный  
				#	9-12 — средний  
				#	13-16 — безымянный  
				#	17-20 — мизинец  
				# ----------------------------------------------------------------------------------------------------------------------------------------------------------------------
				'''
				# у каждого пальца на руке есть свой id. id = 8 - id на указательный палец.
				if id == 8:
					# рисуем точку на пальце. (число визуал)
					cv.circle(image, (cx, cy), 10, (0, 255, 0), cv.FILLED)
					# засекаем время.
					current_time = time.time()
					if prev_x is not None:
						# считаем движения
						# dx - насколько палец сдвинулся по OX.
						# dt - за сколько времени. 
						dx = cx - prev_x
						dt = current_time - prev_time
						# движение должно быть быстрым поэтому это проверка на свайп.
						if dt < TIME_THRESHOLD:
							# движение должно быть достаточно длинным вправо.
							if dx > SWIPE_THRESHOLD:
								# защита от спама. чтобы не улететь в ебеня.
								if current_time - last_swipe_time > COOLDOWN:
									# если все условия выполнены выводим надпись 'SWIPE RIGHT' (число визуал).
									cv.putText(image, 'SWIPE RIGHT', (50, 50),cv.FONT_HERSHEY_COMPLEX,1,(0,255,0),2)
									# проверяем открыт ли powerpoint
									if pow_log.check_powerpoint():
										# в случае true переключаем слайд.
										pow_log.next_slide()
										last_swipe_time = current_time
							#---------------------------------------------------------------------------------
							#elif dx < -SWIPE_THRESHOLD:
								#if current_time - last_swipe_time > COOLDOWN:
									#cv.putText(image,'SWIPE LEFT',(50,50),cv.FONT_HERSHEY_COMPLEX,1,(0,0,255),2)
									#if pow_log.check_powerpoint():
										#import pyautogui as pyu
										#pyu.press('left')
										#last_swipe_time = current_time
							#---------------------------------------------------------------------------------
					# обновляем предыдущие значения для корректного сравнения на предмет свайпа.
					prev_x = cx
					prev_time = current_time
	# показываем изображение.
	cv.imshow("main",image)
	# если нажали на кнопку 'q' программа выключается.
	if cv.waitKey(1) & 0xFF == ord('q'):
		break

# очистка
video.release()
cv.destroyAllWindows()